Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/enforcement_and_redress/employment_appeals.html.txt.tmx
Source language: en
Languages: ga

source: Appealing a decision to the Labour Court
ga: Achomharc a dhéanamh chuig an gCúirt Oibreachais

source: Under the Workplace Relations Act 2015 the Labour Court is the single appeal body for all workplace relations appeals, including those previously heard by the Employment Appeals Tribunal
ga: Faoin Acht um Chaidreamh san Áit Oibre 2015 is í an Chúirt Oibreachais an t-aon fhoras achomhairc amháin maidir le hachomhairc caidrimh san ionad oibre, lena n-áirítear na cinn a chualathas roimhe seo ag an mBinse Achomhairc Fostaíochta

source: You may appeal to it against decisions of a Workplace Relations Commission adjudicator
ga: Féadfaidh tú achomharc a dhéanamh i gcoinne cinntí arna ndéanamh ag breithneoir de chuid an Choimisiúin um Chaidreamh san Áit Oibre

source: The Employment Appeals Tribunal continues to hear appeals submitted before the commencement of the Workplace Relations Act 2015 on 1 October 2015
ga: Leanann an Binse Achomhairc Fostaíochta ag éisteacht le hachomhairc arna gcur faoin a bhráid roimh thús an Acht um Chaidreamh san Áit Oibre 2015 an 1 Deireadh Fómhair 2015

source: Under the Workplace Relations Act 2015 cases are first heard by an adjudicator
ga: Faoin Acht um Chaidreamh san Áit Oibre 2015 is é an breithneoir a éisteann an cás ar dtús

source: You may appeal the decision of the adjudicator to the Labour Court
ga: Féadfaidh tú achomharc a dhéanamh ar chinneadh an bhreithneora chuig an gCúirt Oibreachais

source: The time limit for making an appeal is 42 days after the date of the decision of the adjudicator
ga: Is éard í an teorainn ama chun achomharc a dhéanamh ná 42 lá i ndiaidh dáta chinneadh an bhreithneora

source: This time limit can be extended if the Labour Court is satisfied that there were exceptional circumstances causing the delay
ga: Is féidir an teorainn ama sin a leathnú má bhíonn an Chúirt Oibreachais sásta go raibh imthosca eisceachtúla mar chúis leis an moill

source: The Labour Court may decide to deal with the complaint or dispute by written submissions only, unless either party objects to this within 42 days of being informed
ga: Féadfaidh an Chúirt Oibreachais cinneadh a dhéanamh déileáil leis an ngearán nó an chonspóid trí aighneachtaí i scríbhinn agus sin amháin, mura gcuireann ceachtar páirtí in aghaidh sin laistigh de 42 lá ón bheith curtha ar an eolas

source: You do not have to be represented at the Labour Court, but if you wish you may you may be accompanied and represented at the hearing by:
ga: Ní gá go mbeadh ionadaíocht agat ag an gCúirt Oibreachais, ach más mian leat is féidir duine a bheith leat agus ionadaíocht a bheith agat ag an éisteacht trí:

source: • A trade union official or an official of a body which represents the interests of employers
ga: • Oifigeach ó cheardchumann nó oifigeach ó chomhlacht a dhéanann ionadaíocht ar leasa fostóirí

source: • A practising barrister or practising solicitor
ga: • Aturnae nó abhcóide atá ag cleachtadh a g(h)airme

source: • In the case of a complainant who is aged under 18 a parent or guardian (as well as one of the people already listed)
ga: • I gcás gearánaí atá faoi 18 bliain d’aois, tuismitheoir nó caomhnóir (chomh maith leis na daoine liostaithe cheana)

source: • Any other person with the permission of the Labour Court
ga: • Aon duine eile le cead ón gCúirt Oibreachais

source: If you do not have a representative to present your case, the Labour Court will ensure that you are not at a disadvantage as a result of this
ga: Mura bhfuil ionadaí i láthair ag do chás, cinnteoidh an Chúirt Oibreachais nach mbeidh tú faoi mhíbhuntáiste mar thoradh ar sin

source: You should make sure you have all the relevant documents, such as a P45 or a P60
ga: Ba chóir duit a chinntiú go bhfuil na cáipéisí ábhartha go léir agat, mar shampla P45 nó P60

source: Labour Court hearings on appeals are in public unless the Labour Court decides that they should be in private (or partly in private) because of special circumstances
ga: Bíonn éisteachtaí na Cúirte Oibreachais maidir le hachomhairc poiblí ach amháin nuair a chineann an Chúirt Oibreachais gur chóir dóibh a bheith príobháideach (nó príobháideach i bpáirt) mar gheall ar imthosca speisialta

source: The Labour Court has wide powers to require witnesses to attend and to take evidence on oath
ga: Tá cumhachtaí leathana ag an gCúirt Oibreachais a cheanglaíonn ar fhinnéithe freastal agus fianaise a thógáil faoi mhionn

source: The Labour Court may refer a question of law arising in the appeal to the High Court
ga: Féadfaidh an Chúirt Oibreachais ceist dlí a eascraíonn san achomharc a tharchur chuig an Ard-Chúirt

source: The High Court’s determination is final and conclusive
ga: Is cinneadh críochnaitheach dochloíte é cinneadh na hArd-Chúirte

source: Appealing a Labour Court decision
ga: Achomharc a dhéanamh i ndáil le Cinneadh ón gCúirt Oibreachais

source: In most cases, the decision may be appealed to the High Court by either party but only on a point of law
ga: I bhformhór cásanna, is féidir le ceachtar páirtí achomharc a dhéanamh chuig an Ard-Chúirt ach ach is ar phonc dlí amháin a dhéanfar é

source: Again, the High Court’s determination is final and conclusive
ga: Arís, is cinneadh críochnaitheach dochloíte é cinneadh na hArd-Chúirte

source: Enforcement of a Labour Court decision
ga: Cinneadh na Cúirte Oibreachais a chur i bhfeidhm

source: An employer has 42 days to implement the Labour Court’s decision
ga: Tá 42 lá ag fostóir le cinneadh na Cúirte Oibreachais a chur i bhfeidhm

source: If the employer fails to do so, the employee, the Workplace Relations Commission, the employee’s trade union or excepted body may apply to the District Court for an order directing the employer to do so.(An excepted body is a body that represents the interests of a particular group of workers.) The District Court must grant the order
ga: Má theipeann ar an bhfostóir sin a dhéanamh, féadfaidh an fostaí, an Coimisiún um Chaidreamh san Áit Oibre, ceardchumann an fhostaí nó comhlacht eiscthe iarratas a dhéanamh chuig an gCúirt Dúiche ar ordú a thugann treoir don fhostóir amhlaidh a dhéanamh. (Is éard is comhlacht eiscthe ann ná comhlacht a dhéanann ionadaíocht ar leasa ghrúpa áirithe oibrithe.) Ní mór don Chúirt Dúiche an t-ordú a dheonú

source: In cases where compensation is to be paid, the District Court may also order the payment of interest
ga: I gcásanna ina bhfuil cúiteamh le híoc, féadfaidh an Chúirt Dúiche ordú a thabhairt go n-íocfaí ús

source: It is an offence to fail to comply with an order directing an employer to pay such compensation to an employee unless the employer can show, on the balance of probabilities, that they were unable to comply with the order due to financial circumstances
ga: Is coir é mainneachtain cloí le hordú a thugann treoir d’fhostóir cúiteamh den chineál sin a íoc le fostaí murar féidir leis an fostaí a léiriú, ar chothrom na dóchúlachta, nach raibh sé in ann cloí leis an ordú mar gheall ar imthosca airgeadais

source: To appeal the decision of an adjudicator to the Labour Court you use the Labour Court appeals form (pdf)
ga: Chun achomharc a dhéanamh ar chinneadh bhreithneora chuig an Chúirt Oibreachais baintear úsáid as fhoirm achomharc na Cúirte Oibreachais (pdf)

source: You must make an appeal no later than 42 days from the date of the decision
ga: Ní mór duit achomharc a dhéanamh nach déanaí ná 42 lá ó dháta an chinnte

source: There is further information about making an appeal on workplacerelations.ie
ga: Tá tuilleadh faisnéise maidir le hachomharc a dhéanamh le fáil ar workplacerelations.ie
